app/views/musicians/index.html.erb

SELECT "instruments".* FROM "instruments" INNER JOIN "musician_instruments" ON "instruments"."id" = "musician_instruments"."instrument_id" WHERE "musician_instruments"."musician_id" = ?  [["musician_id", 1]]
---
      <li><%= link_to musician.stage_name, public_path(musician) %></li><br>
      <% musician.instruments.each do |instrument| %>

SELECT "instruments".* FROM "instruments" INNER JOIN "musician_instruments" ON "instruments"."id" = "musician_instruments"."instrument_id" WHERE "musician_instruments"."musician_id" = ?  [["musician_id", 2]]
---
      <li><%= link_to musician.user.full_name, public_path(musician) %></li><br>
    <% musician.instruments.each do |instrument| %>