app/controllers/musicians_controller.rb

SELECT "musicians".* FROM "musicians"
---
  def index
    @musicians = Musician.all

SELECT  "musicians".* FROM "musicians" WHERE "musicians"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def show
    @musician = Musician.find(params[:id])

SELECT "instruments".* FROM "instruments" WHERE 1=0
---
  def new
    # Add a way to check if a user is logged in before creating a new musician
    @musician = Musician.new
    @instruments = Instrument.all

INSERT INTO "musicians" ("stage_name", "location", "bio", "user_id") VALUES (?, ?, ?, ?)  [["stage_name", "Tupac"], ["location", "Compton"], ["bio", "Westside"], ["user_id", 6]]
---
  def create
    @musician = Musician.new(musician_params)
    # @musician.user_id = session[:user_id]
    @musician.user_id = current_user.id

    byebug
    if @musician.valid?
      @musician.save

SELECT  "musicians".* FROM "musicians" WHERE "musicians"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "instruments".* FROM "instruments" WHERE 1=0
---
  def edit
    # Add a way to only be able to edit a musician that belongs to a user

    @musician = Musician.find(params[:id])
    authorized_for(@musician.user_id)
    @instruments = Instrument.all

SELECT  "musicians".* FROM "musicians" WHERE "musicians"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "musicians" SET "stage_name" = ? WHERE "musicians"."id" = ?  [["stage_name", "Wild Jim"], ["id", 2]]
---
  def update
    @musician = Musician.find(params[:id])
    @musician.update(musician_params)